public class JR_task_00_01_Amigo_very_smart {
/*
Амиго очень умный

Задача:
Написать программу, которая выводит на экран надпись: "Амиго очень умный".

Требования:
*/

            public static void main(String[] args) {
            System.out.println("Амиго очень умный");
        }
    }

