public class JR_task_00_01_Amigo_very_smart {
/*
Амиго очень умный

Цель:
Написать программу, которая выводит на экран надпись: "Амиго очень умный".

Требования:
1. Программа должна выводить текст.

*/

            public static void main(String[] args) {
            System.out.println("Амиго очень умный");
        }
    }

