public class JR_task_00_01_Amigo_very_smart {
/*
Амиго очень умный

Цель:
Написать программу, которая выводит на экран надпись: "Амиго очень умный".

Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с "Амиго".
3. Текст должен заканчиваться на "умный".
4. Текст должен состоять из 17 символов, включая пробелы.
*/

            public static void main(String[] args) {
            System.out.println("Амиго очень умный");
        }
    }

